{
    "difficulty-levels": [
        "easy",
        "standard",
        "harder",
        "expert"
    ],

    "density-levels": [
        "sparse",
        "normal",
        "dense",
        "packed"
    ],

    "universe-sizes": [
        "tiny",
        "small",
        "medium",
        "large",
        "huge"
    ],

    "wormhole-stability-levels": [
        "rock solid",
        "stable",
        "mostly stable",
        "average",
        "slightly volatile",
        "volatile",
        "extremely volatile"
    ],

    "ship-types": [
        "unarmed",
        "armed",
        "bomber",
        "freighter",
        "fuel transport"
    ],

    "minerals": [
        "ironium",
        "boranium",
        "germanium"
    ],

    "predefined-race-singular-names": [
        "Antethereal",
        "Humanoid",
        "Insectoid",
        "Nucleotid",
        "Rabbitoid",
        "Silicanoid"
    ],

    "predefined-race-plural-names": [
        "Antethereals",
        "Humanoids",
        "Insectoids",
        "Nucleotids",
        "Rabbitoids",
        "Silicanoids"
    ],

    "predefined-race-descriptions": [
        "<p>The Antethereals excel at remote mining and laying mine fields.  They reproduce quickly and are efficient with their resources.  Their range of habitable planets is small, however, and their war, engine, and penetrating scanner technologies are limited.</p>",
        "<p>The Humanoids are the jack of all trades.  They grow quickly and can survive on most planets.  They can compete well, but have no serious advantages or disadvantages.</p>",
        "<p>The Insectoids have unusual habitation requirements - they are immune to temperature and gravity, but have to find planets with extreme radiation requirements.  They are war-like and grow well enough if given enough space to take hold.  They must be aggressive to survive.</p>",
        "<p>The Nucleotids can live just about anywhere.  They prefer to sneak up and steal enemy resources, but they are also good at remote mining.  They do not grow very fast and research does not come easy to them.</p>",
        "<p>The Rabbitoids grow... like rabbits.  They are good at terraforming worlds to keep up their growth rate and good with their resources.  They have basic remote mining capability and cannot build penetrating scanners, but they should be able to colonize most of the universe anyway.</p>",
        "<p>The Silicanoids are immune to every environmental factor.  They can colonize any world.  They should not spread out too quickly, however, because they do not have a high growth rate.  They are also not very great with research.  The have access to the powerful metamorph hull.</p>"
    ],

    "computer-race-archetype-names": [
        "Robotoids",
        "Turindrones",
        "Automitrons",
        "Rototils",
        "Cybertrons",
        "Macinti"
    ],
        

    "computer-race-singular-names": [
        "Rush'n'",
        "House Cat",
        "Crusher",
        "Berserker",
        "Nee",
        "Loraxoid",
        "House Cat",
        "Hooveron",
        "Mensoid",
        "Bulushi",
        "Bulushi",
        "American",
        "Tritzoid",
        "Hicardi",
        "Ferret",
        "Ubert",
        "American",
        "Nairnian",
        "Nee",
        "Mensoid",
        "Kurkorian",
        "Hawk",
        "Golem",
        "Kurkorian"
    ],

    "computer-race-plural-names": [
        "Rush'n's",
        "House Cats",
        "Crushers",
        "Berserkers",
        "Nees",
        "Loraxoids",
        "House Cats",
        "Hooverons",
        "Mensoids",
        "Bulushis",
        "Bulushis",
        "Americans",
        "Tritzoids",
        "Hicardis",
        "Ferrets",
        "Uberts",
        "Americans",
        "Nairnians",
        "Nees",
        "Mensoids",
        "Kurkorians",
        "Hawks",
        "Golems",
        "Kurkorians"
    ],

    "cpu-difficulties": [
        "easy",
        "normal",
        "tough",
        "expert"
    ],

    "research-areas": [
        "energy",
        "weapons",
        "propulsion",
        "construction",
        "electronics",
        "biotechnology"
    ],

    "tech-abbreviations": [
        "Ener",
        "Weap",
        "Prop",
        "Const",
        "Elect",
        "Bio"
    ],

    "tech-no-requirements": "-- None --",
    "tech-available": "Available",

    "research-cost-option-names": [
        "Expensive",
        "Normal",
        "Cheap"
    ],

    "gameplay-option-names": [
        "Random Events",
        "Public Player Scores",
        "Accelerated Play",
        "Slow Technology Advances",
        "Computer Players Form Alliances",
        "Beginner: Maximum Minerals"
    ],

    "research-cost-option-descriptions": [
        "Costs 75% extra",
        "Costs standard amount",
        "Costs 50% less"
    ],

    "leftover-points-option-names": [
        "Surface Minerals",
        "Mines",
        "Factories",
        "Defenses",
        "Mineral Concentration"
    ],

    "leftover-points-option-descriptions": [
        "10kT rarest surface mineral on homeworld for each point leftover.",
        "One mine for every two points leftover.",
        "One factory for every five points leftover.",
        "One defense for every ten points leftover.",
        "Increase lowest mineral concentration on homeworld by 1% for every three points leftover."
    ],

    "lesser_racial_trait_names": [
        "No Ramscoop Engines",
        "Improved Fuel Efficiency",
        "Cheap Engines",
        "Total Terraforming",
        "Only Basic Remote Mining",
        "Advanced Remote Mining",
        "No Advanced Scanners",
        "Improved Starbases",
        "Low Starting Population",
        "Generalized Research",
        "Bleeding Edge Technology",
        "Ultimate Recycling",
        "Regenerating Shields",
        "Mineral Alchemy"
    ],


    "lesser_racial_trait_descriptions": [
        "<p>Ramscoop engines capable of traveling greater than Warp 4 using no fuel will be unavailable to you.  The Interspace-10 engine, which is capable of traveling at Warp 10 with no damage, will be available to you.</p>",
        "<p>The Fuel Mizer and Galaxy Scoop engines will be available to you. Your starting tech level in Propulsion is increased by 1.  All engines will use 15% less fuel.</p>",
        "<p>You build engines at half cost... however, whenever a ship travels at speeds above Warp 6, there is a 10% chance the engines will not engage.</p> <p>Your starting tech level in Propulsion is increased by 1.</p>",
        "<p>You can terraform by investing solely in Biotechnology technology.  You can terraform an environmental variable by up to 30%.  Terraforming costs 30% less.</p>",
        "<p>The only mining ship available to you will be the Mini-Miner.  Your maximum population per planet is increased by 10%.  Note that if, somehow, a race has both traits Only Basic Remote Mining and Advanced Remote Mining selected, Only Basic Remote Mining will apply.</p>",
        "<p>You will have access to three additional mining hulls and 2 additional robots.  You start the game with two Midget Miners.</p>",
        "<p>No planet penetrating scanners will be available to you.  Conventional scanners will have their range doubled.</p>",
        "<p>Gives you two new starbase designs: the Stardock and the Ultra Station.  The Stardock allows you to build light ships and is capable of refueling ships.  The Ultra Station is a formidable weapons platform.  Your starbases cost 20% less and have base cloaking of 20%.</p>",
        "<p>You will start the game with 30% fewer colonists.</p>",
        "<p>Each year, only half of the dedicated research resources will be dedicated to your chosen research field.  15% of the total research resources will be applied to each other field.</p>",
        "<p>Normally, as you exceed the technology of some component, the cost of the component drops (at a rate of 4% per level).  This is called miniaturization.  Normally, through miniaturization, the cost of component will eventually drop to 24% of its initial cost.</p> <p>Bleeding Edge Technology makes all components cost 200% of their cost when initially researched.  One technology level above, however, will cause the costs to drop to 95% and the cost will drop 5% per tech level, to a final cost of 20% of its initial cost.</p> <p>As a result of the above, technology components gained at Tech 26 will always cost twice as much.</p>",
        "<p>When you scrap a fleet at a starbase, you will recover 90% of the minerals of that fleet as well as some of the resources.  The resources will be available for use the next year.  Scrapping at a planet without a starbase gives half the starbase amount.</p>",
        "<p>All of your shields are 40% stronger than the listed rating.  Shields also regenerate at 10% of their maximum strength after each round of battle.  Your armor, however, will only be at 50% of its rated strength.</p>",
        " <p>You will be able to turn resources into minerals four times more efficiently than normal at any planet you own.</p>"
    ],

    "primary_racial_trait_names": [
        "Claim Adjuster",
        "Jack of All Trades",
        "Interstellar Traveler",
        "Inner Strength",
        "Space Demolition",
        "War Monger",
        "Packet Physics",
        "Super Stealth",
        "Hyper Expansion",
        "Alternate Reality"
    ],

    "primary_racial_trait_descriptions": [
        "<p>Your race excels at fiddling with planetary environments.  You start the game with Tech 6 in Biotechnology and a ship capable of terraforming planets from orbit.  You can arm your ships with bombs capable of de-terraforming enemy worlds.</p> <p>Terraforming costs you nothing and planets you leave revert to their original environments.  Planets you own have up to a 10% chance of improving an environmental variable by 1% per year.</p>",
        "<p>Your race does not specialize in a single area.  You start the game with Tech 3 in all research areas and a number of ships.  Your Scout, Destroyer, and Frigate hulls have built-in penetrating scanners which grow in power as your Electronics tech increases.</p> <p>Your maximum planetary population is 20% greater than other races.</p>",
        "<p>Your race is the master of stargates.  You start the game with Tech 5 in Propulsion and Construction.  If the universe is not tiny, you start out the game with a second planet.  To start, your homeworld and secondary planets will have stargates.</p> <p>Eventually you will be able to build stargates that have unlimited capabilities.  Stargates also cost you 25% less to build.</p> <p>If an enemy planet is in range of your stargate, you will automatically scan their planet if they have a stargate.</p> <p>Finally, exceeding the stated limits of stargates is less likely to destroy your ships.</p>",
        "<p>Your race is strong and hard to defeat.  Your colonists repel attacks better, your ships heal faster, and you have special battle devices that protect your ships.  You can also lay Speed Trap mine fields.</p> <p>You have a device that acts as both a shield and armor.  Your peace-loving people refuse to build Smart Bombs.  Planetary defenses cost you 40% less, but weapons cost you 25% more.</p> <p>Your colonists are able to reproduce while being transported by your fleets.</p>",
        "<p>Your race is the master of mine fields.  You have a vast array of mine fields at your disposal and two hulls unique to your race designed specifically for mine dispersal.</p> <p>Your minefields act as scanners.  You have the ability to remote detonate your Standard mine fields.  You may safely travel two warp speeds faster through enemy mine fields.</p> <p>You start the game with Tech 2 in Propulsion and Biotechnology and 2 mine laying ships.</p>",
        "<p>Your race rules the battlefield.  Your colonists attack better, your ships are faster in battle, and you build weapons 25% cheaper than other races.  You start the game with Tech 6 in Weapons and Tech 1 in Energy and Propulsion.</p> <p>Your race sees no need for mine fields or any but the most basic planetary defenses.</p>",
        "<p>Your race specializes in firing mineral packets across the universe.  You start the game with Tech 4 in Energy and a Warp 5 accelerator at your home planet.  You will eventually be able to fling packets at a blistering speed of Warp 13.</p> <p>You also start the game with a second planet if the universe size is not tiny.</p> <p>All of your packets have penetrating scanners built into them.  Uncaught packets have a chance of terraforming the target planet.</p>",
        "<p>Your race sneaks through enemy territory and executes stunning surprise attacks.  You have the best cloaking devices and your ships have 75% cloaking built in.</p> <p>Unlike other races, cargo does not decrease your cloaking abilities.  The Stealth Bomber and Rogue hull types are only available to your race, as well as a scanner, shield, and armor with stealthy properties.</p> <p>You also get two special scanners that allow you to steal minerals from enemy fleets and planets.  You may travel safely through mine fields at one warp speed faster than the normal limits.</p>",
        "<p>Your race must expand to survive. You are given a small and cheap colony hull and an engine that travels at Warp 6 without using fuel.</p> <p>Your people will grow at twice the growth rate specified in step 4. The maximum growth rate for all planets is halved.</p> <p>The Meta Morph hull is only available to your race.</p>",
        "<p>Your race developed in an alternate plane.  Your colonists do not live on planets and instead live in orbit on your starbases.  Your starbases are 20% cheaper to build.</p> <p>If a starbase at your planet is destroyed, all of the colonists will be destroyed with it.  Your population maximums are determined by the type of starbase at that planet.  Eventually you will be able to build the fearsome Death Star.</p> <p>You do not build planetary installations such as mines, factories, and defenses, however your colonists have an intrinsic ability to mine.  They also can scan for enemy fleets.  You also have the ability to remote mine your own worlds.</p>"
    ],

    "resources": "resources",
    "colonists": "colonists",

    "technology-names": [
        "Viewer 50",
        "Viewer 90",
        "Scoper 150",
        "Scoper 220",
        "Scoper 280",
        "Snooper 320X",
        "Snooper 400X",
        "Snooper 500X",
        "Snooper 620X",
        "SDI",
        "Missile Battery",
        "Laser Battery",
        "Planetary Shield",
        "Neutron Shield",
        "Tritanium",
        "Crobmnium",
        "Carbonic Armor",
        "Strobnium",
        "Organic Armor",
        "Kelarium",
        "Fielded Kelarium",
        "Depleted Neutronium",
        "Neutronium",
        "Valanium",
        "Superlatanium",
        "Mole-skin Shield",
        "Cow-hide Shield",
        "Wolverine Diffuse Shield",
        "Croby Sharmor",
        "Shadow Shield",
        "Bear Neutrino Barrier",
        "Gorilla Delagator",
        "Elephant Hide Fortress",
        "Complete Phase Shield",
        "Mine Dispenser 40",
        "Mine Dispenser 50",
        "Mine Dispenser 80",
        "Mine Dispenser 130",
        "Heavy Dispenser 50",
        "Heavy Dispenser 110",
        "Heavy Dispenser 200",
        "Speed Trap 20",
        "Speed Trap 30",
        "Speed Trap 50",
        "Bat Scanner",
        "Rhino Scanner",
        "Mole Scanner",
        "DNA Scanner",
        "Possum Scanner",
        "Pick Pocket Scanner",
        "Chameleon Scanner",
        "Ferret Scanner",
        "Dolphin Scanner",
        "Gazelle Scanner",
        "RNA Scanner",
        "Cheetah Scanner",
        "Elephant Scanner",
        "Eagle Eye Scanner",
        "Robber Baron Scanner",
        "Peerless Scanner",
        "Colonization Module",
        "Orbital Construction Module",
        "Cargo Pod",
        "Super Cargo Pod",
        "Fuel Tank",
        "Super Fuel Tank",
        "Maneuvering Jet",
        "Overthruster",
        "Beam Deflector",
        "Transport Cloaking",
        "Stealth Cloak",
        "Super Stealth Cloak",
        "Ultra Stealth Cloak",
        "Battle Computer",
        "Battle Super Computer",
        "Battle Nexus",
        "Jammer 10",
        "Jammer 20",
        "Jammer 30",
        "Jammer 50",
        "Energy Capacitor",
        "Flux Capacitor",
        "Energy Dampener",
        "Tachyon Detector",
        "Anti-matter Generator",
        "Total Terraform ± 3",
        "Total Terraform ± 5",
        "Total Terraform ± 7",
        "Total Terraform ± 10",
        "Total Terraform ± 15",
        "Total Terraform ± 20",
        "Total Terraform ± 25",
        "Total Terraform ± 30",
        "Gravity Terraform ± 3",
        "Gravity Terraform ± 7",
        "Gravity Terraform ± 11",
        "Gravity Terraform ± 15",
        "Temperature Terraform ± 3",
        "Temperature Terraform ± 7",
        "Temperature Terraform ± 11",
        "Temperature Terraform ± 15",
        "Radiation Terraform ± 3",
        "Radiation Terraform ± 7",
        "Radiation Terraform ± 11",
        "Radiation Terraform ± 15",
        "Robo-Midget Miner",
        "Robo-Mini-Miner",
        "Robo-Miner",
        "Robo-Maxi-Miner",
        "Robo-Super-Miner",
        "Robo-Ultra-Miner",
        "Orbital Adjuster",
        "Settler's Delight",
        "Quick Jump 5",
        "Fuel Mizer",
        "Long Hump 6",
        "Daddy Long Legs 7",
        "Alpha Drive 8",
        "Trans-Galactic Drive",
        "Interspace-10",
        "Trans-Star 10",
        "Radiating Hydro-Ram Scoop",
        "Sub-Galactic Fuel Scoop",
        "Trans-Galactic Fuel Scoop",
        "Trans-Galactic Super Scoop",
        "Trans-Galactic Mizer Scoop",
        "Galaxy Scoop",
        "Lady Finger Bomb",
        "Black Cat Bomb",
        "M-70 Bomb",
        "M-80 Bomb",
        "Cherry Bomb",
        "LBU-17 Bomb",
        "LBU-32 Bomb",
        "LBU-74 Bomb",
        "Retro Bomb",
        "Smart Bomb",
        "Neutron Bomb",
        "Enriched Neutron Bomb",
        "Peerless Bomb",
        "Annihilator Bomb",
        "Stargate 100/250",
        "Stargate any/300",
        "Stargate 150/600",
        "Stargate 300/500",
        "Stargate 100/any",
        "Stargate any/800",
        "Stargate any/any",
        "Mass Driver 5",
        "Mass Driver 6",
        "Mass Driver 7",
        "Super Driver 8",
        "Super Driver 9",
        "Ultra Driver 10",
        "Ultra Driver 11",
        "Ultra Driver 12",
        "Ultra Driver 13",
        "Orbital Fort",
        "Space Dock",
        "Space Station",
        "Ultra Station",
        "Death Star",
        "Small Freighter",
        "Medium Freighter",
        "Large Freighter",
        "Super Freighter",
        "Scout",
        "Frigate",
        "Destroyer",
        "Cruiser",
        "Battle Cruiser",
        "Battleship",
        "Dreadnought",
        "Privateer",
        "Rogue",
        "Galleon",
        "Mini-Colony Ship",
        "Colony Ship",
        "Mini Bomber",
        "B-17 Bomber",
        "Stealth Bomber",
        "B-52 Bomber",
        "Midget Miner",
        "Mini-Miner",
        "Miner",
        "Maxi-Miner",
        "Ultra-Miner",
        "Fuel Transport",
        "Super-Fuel Xport",
        "Mini Mine Layer",
        "Super Mine Layer",
        "Nubian",
        "Meta Morph",
        "Laser",
        "X-Ray Laser",
        "Mini Gun",
        "Yakimora Light Phaser",
        "Blackjack",
        "Phaser Bazooka",
        "Pulsed Sapper",
        "Colloidal Phaser",
        "Gatling Gun",
        "Mini Blaster",
        "Bludgeon",
        "Mark IV Blaster",
        "Phased Sapper",
        "Heavy Blaster",
        "Gatling Neutrino Cannon",
        "Myopic Disruptor",
        "Blunderbuss",
        "Disruptor",
        "Syncro Sapper",
        "Mega Disruptor",
        "Big Mutha Cannon",
        "Streaming Pulverizer",
        "Anti-Matter Pulverizer",
        "Alpha Torpedo",
        "Beta Torpedo",
        "Delta Torpedo",
        "Epsilon Torpedo",
        "Rho Torpedo",
        "Upsilon Torpedo",
        "Omega Torpedo",
        "Jihad Missile",
        "Juggernaut Missile",
        "Doomsday Missile",
        "Armageddon Missile",
        "Hush-a-boom",
        "Enigma Pulsar",
        "Mega Poly Shell",
        "Langston Shell",
        "Multi-Function Pod",
        "Anti-Matter Torpedo",
        "Jump Gate",
        "Genesis Device",
        "Multi-Contained Munition",
        "Alien Miner",
        "Multi-Cargo Pod",
        "Mini-Morph"
    ],

    "tech-requirements-title": "Tech Req.",

    "ui": {
        "general": {
            "close": "&Close",
            "previous": "Previous",
            "next": "Next"
         },

        "technology-browser": {
            "title": "Technology Browser",
            "show-available-option": "Show Only Available Technology",
            "technology-category-names": [
                "All",
                "Armor",
                "Beam Weapons",
                "Bombs",
                "Electrical",
                "Engines",
                "Mechanical",
                "Mine Layers",
                "Mining Robots",
                "Orbital",
                "Planetary",
                "Scanners",
                "Shields",
                "Ship Hulls",
                "Starbase Hulls",
                "Terraforming",
                "Torpedoes"
            ],

            "fine-details": {
                "armor-strength": "Armor Strength",
                "power": "Power",
                "range": "Range",
                "initiative": "Initiative",
                "fielded-kelarium": "This armor also acts as part shield which will absorb 50 damage points.",
                "depleted-neutronium": "This armor decreases the range at which enemy ships can see the ship by 25%.",
                "mini-gun": "This weapon hits all targets in range each time it is fired.  This weapon also makes an excellent mine sweeper capable of sweeping 208 mines per year.",
                "sapper": "This weapon will only damage shields.  It has no effect on armor.",
                "gatling-gun": "This weapon hits all targets in range each time it is fired.  This weapon also makes an excellent mine sweeper capable of sweeping 496 mines per year.",
                "gatling-neutrino-cannon": "This weapon hits all targets in range each time it is fired.  This weapon also makes an excellent mine sweeper capable of sweeping 1280 mines per year.",
                "big-mutha-cannon": "This weapon hits all targets in range each time it is fired.  This weapon also makes an excellent mine sweeper capable of sweeping 3264 mines per year.",
                "normal-bomb-with-minimum": "This bomb will kill approximately {0!s}% of a planet's population each year.  If a planet has no defenses, this bomb is guaranteed to kill at least {1!s}.\n\nThis bomb will destroy approximately {2!s} of a planet's mines, factories, and/or defenses each year.",
                "normal-bomb-no-minimum": "This bomb will kill approximately {0!s}% of a planet's population each year.\n\nThis bomb will destroy approximately {1!s} of a planet's mines, factories, and/or defenses each year.",
                "smart-bomb": "This bomb will kill approximately {0!s}% of a planet's population each year.  Smart bombs are not strictly additive and have no minimum kill value.  Defenses are less effective against these bombs.\n\nThis bomb will not damage a planet's mines or factories.",
                "retro-bomb": "This bomb does not kill colonists or destroy installations.  This bomb 'unterraforms' planets toward their original state up to 1% per variable per year.  Planetary defenses have no effect on this bomb."
            }
        }
    },

    "prebuilt-ship-design-names": [
        "Smaugarian Peeping Tom"
    ],

    "scanner-defense-AR-restriction": "Planetary scanners and defenses are unavailable to races with the 'Alternate Reality' primary racial trait",
    "advanced-defenses-restriction": "This planetary defense is unavailable to races with either the 'War Monger' or 'Alternate Reality' primary racial trait",
    "inner-strength-smart-bomb-restriction": "This bomb is unavailable to races with the 'Inner Strength' primary racial trait",
    "colonization-module-restriction": "This part is unavailable to races with the 'Alternate Reality' primary racial trait",
    "war-monger-restriction": "This part is unavailable to races with the 'War Monger' primary racial trait",
    "hyper-expansion-restriction": "Stargates are unavailable to races with the 'Hyper Expansion' primary racial trait",

    "penetrating-scanner-restriction": "This scanner is unavailable to races that have the lesser racial trait 'No Advanced Scanners'",
    "no-ram-scoop-engine-restriction": "This engine is unavailable to races that have the lesser racial trait 'No Ramscoop Engines'",
    "speed-trap-20": "This mine requires the primary racial trait 'Space Demolition' or 'Inner Strength'",
    "obrm-restriction": "This robot miner is unavailable to races that have the lesser racial trait 'Only Basic Remote Mining'",

    "inner-strength-armor": "This armor requires the primary racial trait 'Inner Strength'",
    "super-stealth-armor": "This armor requires the primary racial trait 'Super Stealth'",

    "inner-strength-part": "This part requires the primary racial trait 'Inner Strength'",
    "war-monger-part": "This part requires the primary racial trait 'War Monger'",
    "claim-adjuster-part": "This part requires the primary racial trait 'Claim Adjuster'",
    "ar-only-part": "This part requires the primary racial trait 'Alternate Reality'",

    "inner-strength-device": "This device requires the primary racial trait 'Inner Strength'",
    "hyper-expansion-device": "This device requires the primary racial trait 'Hyper Expansion'",
    "space-demolition-device": "This device requires the primary racial trait 'Space Demolition'",
    "interstellar-traveler-device": "This device requires the primary racial trait 'Interstellar Traveler'",

    "it-stargate": "This stargate requires the primary racial trait 'Interstellar Traveler'",
    "pp-mass-driver": "This mass driver requires the primary racial trait 'Packet Physics'",
    "super-stealth-cloak": "This cloak requires the primary racial trait 'Super Stealth'",
    "super-stealth-scanner": "This scanner requires the primary racial trait 'Super Stealth'",
    "inner-strength-shield": "This shield requires the primary racial trait 'Inner Strength'",
    "super-stealth-shield": "This shield requires the primary racial trait 'Super Stealth'",
    "inner-strength-hull": "This hull requires the primary racial trait 'Inner Strength'",
    "joat-hull": "This hull will have a built-in scanner for races with the primary racial trait 'Jack of All Trades'",
    "war-monger-hull": "This hull requires the primary racial trait 'War Monger'",
    "super-stealth-hull": "This hull requires the primary racial trait 'Super Stealth'",
    "hyper-expansion-hull": "This hull requires the primary racial trait 'Hyper Expansion'",
    "arm-hull": "This hull requires the lesser racial trait 'Advanced Remote Mining'",
    "obrm-hull-restriction": "This hull is unavailable to races that have the lesser racial trait 'Only Basic Remote Mining'",
    "sd-hull": "This hull requires the primary racial trait 'Space Demolition'",
    "arm-robot": "This robot miner requires the lesser racial trait 'Advanced Remote Mining'",
    "improved-starbases-hull": "This starbase hull requires the lesser racial trait 'Improved Starbases'",
    "ar-starbase-hull": "This starbase hull requires the primary racial trait 'Alternate Reality'",
    "total-terraforming-tech": "Total terraforming requires the lesser racial trait 'Total Terraforming'",

    "ife-engine": "This engine requires the lesser racial trait 'Improved Fuel Efficiency'",
    "no-ram-scoop-engine": "This engine requires the lesser racial trait 'No Ram Scoop Engines'",
    "capital-ship-missiles": "Capital ship missiles do twice the stated damage if the enemy ship has no remaining shields.",

    "inner-strength-jammer": "This jamming device requires the primary racial trait 'Inner Strength'",
    "sd-mine": "This mine requires the primary racial trait 'Space Demolition'",

    "settlers-delight-engine": "This engine can only be mounted on the Mini-Colonizer Hull and requires the primary racial trait 'Hyper Expansion'",
    "radiating-engine":  "This engine creates powerful waves of radiation and will kill some colonists if the midpoint of the race's Radiation band is not at least 85mR",

    "original-game-strings": [
        "The {0!s} colonists you dropped on {1} were massacred by the ground troops of {2}.",
        "Of the {0!s} colonists you dropped on {1}, {2!s} were destroyed by planetary defenses, the rest were massacred by the ground troops of {3}.",
        "The {0!s} colonists you forced to transport down to {2} died because you did not colonize the planet first.",
        "Your ground troops on {0} valiantly destroyed the {1!s} attacking barbarians of {2}!",
        "Your planetary defenses and ground troops on {0} destroyed the {1!s} invading troops of {2}.",
        "A multitude of enemies have mounted a {0!s}-prong attack on {1}. In the resulting free-for-all everyone involved was killed.",
        "You were involved in a {0!s}-way assault on {1}. Nobody's troops survived the brutal war.",
        "{0} have attacked you on {1} with {2!s} first-rate storm troopers. Though your colonists put up a spirited defense they are crushed.",
        "You were involved in a {0!s}-way race for the uninhabited planet, {1}. Your forces crush all the opposition.",
        "Your colonists were destroyed in a {0!s}-way race for the uninhabited planet, {1}. {2} now in control of the planet.",
        "Your colonists are now in control of {0}.",
        "Your colonists have deployed the Orbital Construction Module and you now have a Starter Colony orbiting {0}.",
        "Your troops crush {0}'s colonists on {1}. You are now in control of the planet.",
        "Your colonists you dropped on {0} are destroyed in the spirited fighting.",
        "There was a massive blood bath at {0} involving {1!s} fleets of {2!s} races. There were no survivors.",
        "{0} slaughtered all opposition at {1} without losing a single ship.",
        "{0} destroyed all opposition at {1} with only minimal losses.",
        "{0} defeated all opposition at {1} but suffered heavy losses.",
        "Your fleets at {0} destroyed all opposition.",
        "Your fleets at {0} defeated all opposition but suffered heavy losses.",
        "Your fleet at {0} was obliterated in an {1!s}-way struggle which only {2!s} survived.",
        "All of your fleets at {0} were destroyed in an {1!s}-way battle leaving {2} as the sole survivor.",
        "Your people on {0} witnessed the spectacle of {1!s} fleets of {2!s} other races obliterating each other.",
        "Your colony on {0} observed the forces of {1} defeating the forces of {2!s} other races.",
        "{0} and the forces of {1} destroyed each other at {2}.",
        "Your glorious {0} stomped the forces of {1} at {2}.",
        "The mighty {0} defeated the forces of {1} at {2} but took heavy casualties.",
        "Your fleets at {0} trounced the barbarous forces of {1}.",
        "Your vigilant fleets at {0} managed to defeat the savage vermin of {1} but not without great loss.",
        "Your brave forces at {0} were obliterated by the vastly greater forces of the cowardly {1}.",
        "Your forces at {0} died valiantly taking many of the {1} vermin with them.",
        "{0} was lost at {1} in a terrible massacre perpetrated by the villainous {2}.",
        "In a close fight at {0}, {1} did great damage to the forces of {2} before being destroyed.",
        "Your people on {0} watched in amazement as the forces of {1} and {2} annihilated each other.",
        "Your colony on {0} observed {1} forces defeating the forces of {2}.",
        "All of your colonists on {0} have died off. You no longer control the planet.",
        "All of your colonists orbiting {0} have died off. Your starbase has been lost and you no longer control the planet.",
        "The population on {0} has decreased from {1!s} to {2!s}.",
        "The population on {0} has decreased by {1!s} colonists due to overcrowding.",
        "{0} has run out of fuel.",
        "{0}'s waypoint, {1}, appears to have been destroyed or has disappeared. Orders have been changed to go to the last known location of the fleet.",
        "The fleet you were tracking with {0}, appears to have ducked behind {1}. Orders for your fleet have been changed to go to that planet.",
        "The fleet you were tracking with {0}, appears to have outrun the range of your scanners. Orders for your fleet have been changed to go to the last known location of that fleet.",
        "{0} has loaded {1!s} of {2} from {3}.",
        "{0} has beamed {1!s} {2} from {3}.",
        "{0} has unloaded {1!s} of {2} to {3}.",
        "{0} has beamed {1!s} {2} to {3}.",
        "Your starbase at {0} has built a new {1}.",
        "Your starbase at {0} has built {1!s} new {2} ships.",
        "Your starbase at {0} has built a new {1} which is being routed to {2}.",
        "Your starbase at {0} has built {1!s} new {2} ships which are being routed to {3}.",
        "Your starbase at {0} has built a new {1} which will not be routed to {2} due to a lack of fuel.",
        "Your starbase at {0} has built {1!s} new {2} ships which will not be routed to {3} due to a lack of fuel.",
        "You have built a factory on {0}.",
        "You have built {0!s} factories on {1}.",
        "You have built a mine on {0}.",
        "You have built {0!s} mines on {1}.",
        "You have built a defense outpost on {1}.",
        "You have built {0!s} defense outposts on {1}.",
        "You have upgraded the {0!s} defenses on {1} to use {2} technology.",
        "There isn't enough fuel available at {0} to allow {1} to get to the next waypoint. Your fleet will wait for more fuel. You need about {2!s}mg more fuel.",
        "{0} will never make it to its next waypoint as its fuel capacity is {1!s}mg and the trip requires approximately {2!s}mg of fuel.",
        "{0} has completed its orders. The production queue is empty.",
        "The production queue on {0} is empty.",
        "All of your colonists on {0} have jumped ship. You no longer control the planet.",
        "Your colonists orbiting {0} have abandoned their starbase and you no longer control the planet.",
        "{0} successfully transferred {1!s} of {2} to {0}.",
        "{0} successfully transferred {1!s} {2} to {0}.",
        "{0} successfully received {1!s} of {2} from {3}.",
        "{0} successfully received {1!s} {2} from {3}.",
        "{0} attempted to transfer {1!s} of {2} to {3}. Only {4!s} was successfully received.",
        "{0} attempted to transfer {1!s} {2} to {3}. Only {4!s} colonists were successfully received. The rest perished in deep space!",
        "{0} only received {1!s} of {2} from {3}. However, {4} was sent. The remainder was lost in space.",
        "{0} only received {1!s} {2} from {3}. However, {4!s} colonists were sent. The remains of the other colonists are scattered across deep space!",
        "{0} attempted to transfer {1!s} of {2} to {3}. None of it was successfully received.",
        "{0} attempted to transfer {1!s} {2} to {3}. None of the colonists were successfully received. They all perished in deep space!",
        "{0} attempted to receive {1!s} of {2} from {3}. However, all of it was lost in deep space.",
        "{0} attempted to receive {1!s} {2} from {3}. However, none of the colonists were successfully received. The remains of colonists are scattered across deep space!",
        "{0} has completed its assigned orders.",
        "Your starbase at {0} failed to build a new ship of type {1} because someone lost the plans!",
        "Your scientists have completed research into Tech Level {0!s} for {1}. They will continue their efforts in the {2} field.",
        "{0} has an order to colonize, but is not currently in orbit of a planet. This order has been canceled.",
        "{0} has orders to colonize {1}, but {1} is already populated. The colonize order has been canceled.",
        "{0} has orders to colonize {1}, but you have failed to bring along any colonists. The colonize order has been canceled.",
        "{0} has orders to colonize {1}, but none of the ships in {2} have a colonization module. The colonize order has been canceled.",
        "{0} has tried to beam colonists down to {1}, but the planet is uninhabited. You must outfit a ship with a colony module and give it orders to colonize.",
        "The captain of {0} has attempted to beam colonists down to {1}, but was overruled by the bridge crew since your people cannot survive on the surface of a planet.",
        "Your colonists attempting to set up shop on {0} were reduced to protoplasmic blobs when they landed on the surface due to their inability to survive on planets.",
        "All of your colonists assaulting {0} have been killed by forces from the orbiting starbase.",
        "{0} has been dismantled for {1!s}kT of minerals which have deposited on {2}.",
        "{0} has been dismantled for {1!s}kT of minerals at the starbase orbiting {2}.",
        "{0} has been dismantled. The scrap was left in deep space.",
        "{0} has been dismantled for {1!s}kT of minerals which have deposited on {2}. Ultimate recycling has also made {3!s} resources available for immediate use.",
        "{0} has been dismantled for {1!s}kT of minerals at the starbase orbiting {2}. Ultimate recycling has also made {3!s} resources available for immediate use.",
        "Your colonists settling {0!s} have found a strange artifact boosting your research in {1} by {2!s} resources.",
        "Your recent breakthrough in {0} has also given you the {1} benefit.",
        "{0} has bombed {1}, killing {2!s} colonists.",
        "{0} has bombed {1}, destroying one installation.",
        "{0} has bombed {1}, destroying {2!s} defenses, factories and mines.",
        "{0} has bombed {1}, killing {2!s} colonists, and destroying one installation.",
        "{0} has bombed {1}, killing {2!s} colonists, and destroying {3!s} defenses, factories and mines.",
        "{0} has bombed {1}, killing {2!s} colonists. Planetary defenses stopped {3!s} of your bombs.",
        "{0} has bombed {1}, destroying one installation. Planetary defenses stopped {2!s} of your bombs.",
        "{0} has bombed {1}, destroying {2!s} factories and mines. Planetary defenses stopped {3!s} of your bombs.",
        "{0} has bombed {1}, killing {2!s} colonists, and destroying one installation.  Planetary defenses stopped {3!s} of your bombs.",
        "{0} has bombed {1}, killing {2!s} colonists, and destroying {3!s} defenses, factories and mines. Planetary defenses stopped {4!s} of your bombs.",
        "The {0} has bombed {1}, killing {2!s} of your colonists.",
        "The {0} has bombed {1}, destroying one of your installations.",
        "The {0} has bombed {1}, destroying {2!s} of your defenses, factories and mines.",
        "The {0} has bombed {1}, killing {2!s} of your colonists, and destroying one of your installations.",
        "The {0} has bombed {1}, killing {2!s} of your colonists, and destroying {3!s} of your defenses, factories and mines.",
        "The {0} has bombed {1}, killing {2!s} of your colonists. Planetary defenses destroyed {3!s} of the incoming bombs.",
        "The {0} has bombed {1}, destroying one of your installations. Planetary defenses destroyed {2!s} of the incoming bombs.",
        "The {0} has bombed {1}, destroying {2!s} of your defenses, factories and mines. Planetary defenses destroyed {3!s} of the incoming bombs.",
        "The {0} has bombed {1}, killing {2!s} of your colonists, and destroying one of your installations. Planetary defenses destroyed {3!s} of the incoming bombs.",
        "The {0} has bombed {1}, killing {2!s} of your colonists, and destroying {3!s} of your defenses, factories and mines. Planetary defenses destroyed {4!s} of the incoming bombs.",
        "Engine radiation has killed {0!s} colonists traveling in {1}.",
        "{0} had orders to mine {1}, but the fleet doesn't have any remote mining modules. The order has been canceled.",
        "Remote mining robots from {0} had orders to mine {1}, but the planet is inhabited. The order has been canceled.",
        "Remote mining robots from {0} had orders to mine in deep space. The order has been canceled.",
        "Your recent breakthrough in {0} has also given you the {1} hull type. To build ships with this design, go to the Ship Design dialog, select Available Hull Types, and press Copy Selected Design.",
        "{0} has loaded {1!s} of {2} from {3}.",
        "{0} has beamed over {1!s} {2!s} from {3}.",
        "Your terraforming efforts on {0} have {1} the {2} to {3!s}.",
        "{0} has built a new {1} planetary scanner.",
        "{0} has been loaded with {1!s} of {2} by the mining robots of {3} working on {4}.",
        "A battle took place at {0}. Press the Goto button to view the recording of the battle.",
        "Tip: You can hide unimportant messages by clicking the checkmark in the messages title bar. You can reshow these messages at any time by clicking on the magnifying glass in the title bar.",
        "Tip: To add waypoints, select a ship, then click on the desired destination while holding down the Shift key. You can also drag existing waypoints to move them to a new location.",
        "Tip: To design your own ships, press 'F4', select 'Available Hull Types', pick one from the dropdown, and hit the 'Copy' button.",
        "Tip: Popup help is available over many of the displayed statistics. For example you can click on planet statistics in the summary window to get additional details.",
        "A small comet has crashed into {0} bringing new minerals and altering the planet's environment.",
        "A medium-sized comet has crashed into {0} bringing a significant quantity of minerals to the planet.",
        "A large comet has crashed into {0} bringing a wide variety of new minerals and drastically altering the planet's environment.",
        "A huge comet has crashed into {0} embedding vast quantities of minerals in the planet and radically altering its environment.",
        "A small comet has crashed into your planet {0}, killing 25% of your colonists. The comet brought additional minerals and has altered the planet's {1}.",
        "A medium-sized comet has crashed into your planet {0}, killing 45% of your colonists. The comet brought additional minerals and has altered the planet's {1} and {2}.",
        "A large comet has crashed into your planet {0}, killing 65% of your colonists. The comet brought significant quantities of minerals and has altered the planet's {1}, {2}, and {3}.",
        "A huge comet has crashed into your planet {0}, killing 85% of your colonists. The comet has embedded vast stores of minerals and has altered the planet's {1}, {2}, and {3}.",
        "{0} has run out of fuel. The fleet's speed has been decreased to Warp {1!s}.",
        "Your scientists on {0} have transmuted common materials into {1!s}kT each of Ironium, Boranium and Germanium.",
        "A battle took place at {0}. Your {1} was destroyed. The screams of {2!s} colonists echo in your brain.",
        "A battle took place at {0}. Your {1} was destroyed. All {2!s} colonists have joined with the cosmic all.",
        "{0} has bombed {1}, killing off all the enemy colonists.",
        "{0} has bombed {1}, killing all of your colonists.",
        "A battle took place at {0}. Your {1} destroyed {2}, taking no damage.",
        "A battle took place at {0}. Your {1} was destroyed by {2}, which took no damage.",
        "A battle took place at {0}. Your {1} destroyed {2}, however, it took some damage in the fray.",
        "A battle took place at {0}. Your {1} was destroyed by {2}, which was damaged in the fray.",
        "A battle took place at {0}. Neither your {1} nor {2} was destroyed in the incident.",
        "A battle took place at {0}. Your {1}*{2!s} destroyed {3}*{4!s}, taking no damage.",
        "A battle took place at {0}. Your {1}*{2!s} was destroyed by {3}*{4!s}, which took no damage.",
        "A battle took place at {0}. Your {1}*{2!s} destroyed {3}*{4!s}, however, it took some damage in the fray.",
        "A battle took place at {0}. Your {1}*{2!s} was destroyed by {3}*{4!s}, which was damaged in the fray.",
        "A battle took place at {0}. Neither your {1}*{2!s} nor {3}*{4!s} was completely destroyed in the incident.",
        "A battle took place at {0} against {1}. {2!s} of your forces destroyed all of the enemy forces, taking no casualties.",
        "A battle took place at {0} against {1}. All of your forces were destroyed by {2!s} of the enemy's forces.",
        "A battle took place at {0} against {1}. {2!s} of your forces destroyed all of the enemy forces, however, {3!s} of your ships were destroyed.",
        "A battle took place at {0} against {1}. All of your forces were destroyed by {2!s} of the enemy's forces. You managed to destroy {3!s} of the enemy's forces.",
        "A battle took place at {0} against {1}. Neither your {2!s} forces nor the enemy's {3!s} forces were completely wiped out. You lost {4!s} and the enemy lost {5!s}.",
        "A battle took place at {0} against {1}. {2!s} of your forces destroyed {3}, taking no casualties.",
        "A battle took place at {0} against {1}. Your {2} was destroyed by {3!s} of the enemy's forces.",
        "A battle took place at {0} against {1}. {2!s} of your forces destroyed {3}, however, {4!s} of your forces were destroyed.",
        "A battle took place at {0} against {1}. Your {2} was destroyed by {3!s} of the enemy's forces. You managed to destroy {4!s} of the their forces.",
        "A battle took place at {0} involving {1!s} races. {2!s} of your forces destroyed all the enemy forces without a single casualty.",
        "A battle took place at {0} involving {1!s} races. You lost {2!s} of your {3!s} forces. All of the enemy forces were destroyed.",
        "A battle took place at {0} involving {1!s} races. Your entire armada of {2!s} forces was destroyed by {3!s} enemy forces. You didn't manage to destroy a single ship.",
        "A battle took place at {0} involving {1!s} races. Your entire armada of {2!s} forces was destroyed by {3!s} enemy forces. They lost {4!s} forces.",
        "A battle took place at {0} involving {1!s} races. You lost {2!s} of your {3!s} forces while they lost {4!s} of their {5!s} forces.",
        "Your home planet is {0}. Your people are ready to leave the nest and explore the universe. Good luck.",
        "You have found a planet occupied by someone else. {0} is currently owned by {1}.",
        "You have found a new planet which unfortunately is not habitable by you. {0!s} of your colonists will die each year if you colonize {1}.",
        "You have found a new habitable planet.  Your colonists will grow by up to {0!s} per year if you colonize {1}.",
        "You have found a new planet but you don't know if it is habitable or not yet. {0} will remain a mystery until you visit it with a fleet with better scanners.",
        "You have found a new planet which you have the ability to make habitable. With terraforming, your colonists will grow by up to {0!s} per year if you colonize {1}.",
        "{0} has built as many mines as the current population can operate. Auto building of mines is temporarily blocked.",
        "{0} has built as many mines as the planet can support. Auto building of mines is stopped.",
        "{0} has built as many factories as the current population can operate. Auto building of factories is temporarily blocked.",
        "{0} has built as many factories as the planet can support. Auto building of factories is stopped.",
        "{0} has built as many defenses as the current population can operate. Auto building of defenses is temporarily blocked.",
        "{0} has built as many defenses as the planet can support. Auto building of defenses is stopped.",
        "The forces of {0} have been declared the winner of this game. You are advised to accept their supremacy, though you may continue the fight.",
        "You have been declared the winner of this game. You may continue to play though, if you wish to really rub everyone's nose in your grand victory.",
        "You, along with {0} have been declared the winners of this game. You may continue to play though, if you wish to attempt to improve your standing among your fellow dictators.",
        "You are dead. All your planets have been overrun and your spaceships defeated.",
        "The order to build a scanner at {0} was canceled as you already have a scanner there.",
        "All traces of {0} have been eliminated from the galaxy, may they rest in peace.",
        "All traces of every other rival have been eliminated from the galaxy. You alone are left to rule the universe!",
        "{0} has accomplished all the remote terraforming you are currently capable of performing at {1}.",
        "Someone has swept {0!s} mines from your {1} mine field at {2}.",
        "{0} has attempted to lay mines. The order has been canceled because no ship in the fleet has a mine laying pod.",
        "The Mystery Trader has decided to make another pass through known space to increase access to his wares.",
        "Due to the rigors of warp acceleration, {0!s} of your colonists on {1} have died.",
        "{0} has swept {1!s} mines from a {2} {3} mine field at {4}.",
        "{0} has dispersed {1!s} mines.",
        "{0} has increased a minefield by {1!s} mines.",
        "{0} has been stopped in a {1} {2} mine field at {3}.",
        "{0} has been stopped in a {1} {2} mine field at {3}. Your fleet has taken {4!s} damage points but none of your ships were destroyed.",
        "{0} has been stopped in a {1} {2} mine field at {3}. Your fleet has taken {4!s} damage points and {5!s} of your ships were destroyed.",
        "{0} has been annihilated in a {1} {2} mine field at {3}.",
        "{0} has been stopped in your {1} mine field at {2}.",
        "{0} has been stopped in your {1} mine field at {2}. Your mines have inflicted {3!s} damage points, but you didn't manage to destroy any ships.",
        "{0} has been stopped in your {1} mine field at {2}. Your mines have inflicted {3!s} damage points and you have destroyed {4!s} of the ships.",
        "{0} has been annihilated in your {1} mine field at {2}.",
        "{0} has built a new {1}.",
        "{0} has built a new {1}. Ships up to {2!s}kT in total hull weight can now be built at this facility.",
        "{0} has built a new {1}. Ships of any size can now be built here.",
        "Your recent breakthrough in {0} has also given you the {1} hull. To design starbases with this hull, go to the Ship Design dialog, select Starbases, Available Hull Types, and press Copy Selected Design.",
        "The mineral packet formed at {0!s} has disintegrated because the planet does not have a mass accelerator.",
        "The mineral packet formed at {0!s} has disintegrated because you didn't target the mass accelerator. Click on the Set Dest button in the Starbase tile to target the accelerator.",
        "{0} has produced a mineral packet which has a destination of {1}.",
        "{0} has produced a mineral packet which has been combined with another packet heading for {1}.",
        "Your mass accelerator at {0} has successfully captured a packet containing {1!s}kT of minerals.",
        "Your mass accelerator at {0} was partially successfully in capturing a {1!s}kT mineral packet. Unable to completely slow the packet, {2!s} of your colonists were killed in the collision.",
        "Your mass accelerator at {0} was partially successfully in capturing a {1!s}kT mineral packet. Unfortunately, {2!s} of your colonists and {3!s} of your defenses were destroyed in the collision.",
        "{0} was bombarded with a {1!s}kT mineral packet. {1!s} of your colonists were killed by the collision.",
        "{0} was bombarded with a {1!s}kT mineral packet. {1!s} of your colonists and {2!s} of your defenses were destroyed by the collision.",
        "{0} was annihilated by a mineral packet.  All of your colonists were killed.",
        "{0} didn't get all the {1} it attempted to transfer from the mineral packet as another player stole it first. Only {2!s}kT of {3!s} was actually acquired.",
        "{0} didn't get any of the {1} it attempted to transfer from the mineral packet as another player stole it first.",
        "{0} was unable to transfer {1!s}kT of {2} out of the {3!s}kT request.",
        "{0} attempted to use a stargate at {1}, but no stargate exists there.",
        "One of your ships in {0} was destroyed when its engines over-reacted trying to achieve Warp 10.",
        "{0!s} of your ships in {1} were destroyed due to engine strain.",
        "{0} was destroyed in a massive reactor accident due to unsafe operating procedures.",
        "{0} attempted to use the stargate at {1} to reach {2} but could not because no stargate could be detected at the destination.",
        "{0} attempted to use the stargate at {1} to reach {2} but could not because the destination is out of range.",
        "{0} attempted to use the stargate at {1} to reach {2} but could not because ships of type {3} are too massive.",
        "{0} attempted to use the stargate at {1} to reach {2} but could not because the starbase at {3} blocked it. The planet at each end must be owned by you or a friend of yours.",
        "{0} attempted to use the stargate at {1} but could not because the starbase at {2} is not owned by you or a friend of yours.",
        "Heedless to the danger, {0} attempted to use the stargate at {1} to reach {2}.  The fleet never arrived. The distance or mass must have been too great.",
        "{0} used the stargate at {1} to reach {2} losing only {3!s} ships to the treacherous void.  They were fortunate.  They exceeded the capability of the gates.",
        "{0} used the stargate at {1} to reach {2} losing {3!s} ships to the unforgiving void. Exceeding the capability of your stargates is not recommended.",
        "{0} used the stargate at {1} to reach {2} unfortunately losing {3!s} ships to the great unknown. Exceeding the capability of your stargates is dangerous.",
        "{0} used the stargate at {1} to reach {2} losing an unbelievable {3!s} ships. The jump was far in excess of the capabilities of starbases involved.",
        "{0} has unloaded {1!s}kT of minerals to {2} in preparation for jumping through the stargate.",
        "{0} has unloaded {1!s} colonists to {2} in preparation for jumping through the stargate.",
        "{0} has unloaded {1!s} colonists and {2!s}kT of minerals to {3} in preparation for jumping through the stargate.",
        "Wreckage discovered at your battle at {0} has boosted your research in {1} by {2!s} resources.",
        "Wreckage from the battle that occurred in orbit of {0} has boosted your research in {1} by {2!s} resources.",
        "Your fleet found wreckage from the battle at {0} which has boosted your research in {1} by {2!s} resources.",
        "{0} was unable to engage it's engines due to balky equipment. Engineers think they have the problem fixed for the time being.",
        "{0}'s ram scoops have produced {1!s}mg of fuel from interstellar hydrogen.",
        "Your starbase at {0} has swept {1} mines from a {2} {3} mine field at {4}.",
        "{0} was unable to complete it's merge orders as the waypoint destination wasn't a fleet.",
        "{0} was unable to complete it's merge orders as the destination fleet wasn't one of yours.",
        "{0} has been merged into {1}.",
        "The wormhole that {0} was heading for has vanished. Orders have been changed to go to the last known location of the wormhole.",
        "Your colony on {0} reports a battle took place in orbit. Your forces were not involved.",
        "{0} reports a battle took place at {1}. Your forces were not involved.",
        "Your colonists in {0} have made good use of their time increasing their on-board number by {1!s} colonists.",
        "{0} does not have enough minerals available to fling any packets this year.",
        "Fundamental changes in the environment of {0} have permanently altered the planet's {1}. This change has canceled all planetary production.",
        "Your surveyors on {0} have discovered a previously unknown deposit of {1}, significantly increasing the planet's concentration.",
        "Your patrolling {0} has targeted {1} for intercept.",
        "The Mystery Trader has refused to give the captain of {0} an audience. It may be due to an insufficient quantity of minerals carried by your fleet.",
        "{0} has been absorbed by the Mystery Trader. The trader has given you {1!s} technology advances. The trader suggests that you visit other traders as they may carry different items of interest.",
        "{0} has been absorbed by the Mystery Trader. In return, the trader has given you {1!s} technology advances.",
        "{0} has been absorbed by the Mystery Trader. You have been given the plans for a unique part to place on your ships. The trader suggests you visit other traders.",
        "{0} has been absorbed by the Mystery Trader. In return, you have been given the plans for a new ship hull. The trader suggests you visit other traders.",
        "{0} has been absorbed by the Mystery Trader. However, the trader was unable to teach you anything new.",
        "{0} has been absorbed by the Mystery Trader. However, the trader was unable to teach you anything new. The trader says that you might have better luck with a different trader.",
        "{0} has been absorbed by the Mystery Trader. In return, you have been given the plans for a powerful planetary device. The trader suggests you visit other traders.",
        "The Mystery Trader {0} was heading for has vanished. Orders have been changed to go to the last known location of the Trader.",
        "The Mine Field {0} was heading for has vanished. Orders have been changed to go to the last known location of the field.",
        "{0} does not have enough minerals available to continue its auto build orders.",
        "A battle took place at {0} against {1}. Your {2} destroyed all {3!s} of the enemy forces.",
        "A battle took place at {0} against {1}. All {2!s} of your forces were destroyed by {3}.",
        "A battle took place at {0} against {1}. Neither your {2} nor the enemy's {3!s} forces were completely wiped out. The enemy lost {4!s}.",
        "A battle took place at {0} against {1}. Neither your {2!s} forces nor {3} were completely wiped out. You lost {4!s}.",
        "The Mystery Trader eyes the captain of {0} suspiciously and suggests that he is still recovering from the last transaction with you.",
        "{0} has stolen {1!s} of {2} from {3}.",
        "Strong fundamental forces have rebirthed {0}.",
        "{0} attempted to execute transfer orders with {1} involving either fuel or colonists. The attempt failed.",
        "{0} attempted to execute transfer orders at {1} involving fuel. Planets have no way to store fuel.",
        "{0} had orders to transfer cargo to or from a {1}. A futile pursuit.",
        "{0} attempted to load {1} from a planet you don't control. Order has been canceled.",
        "{0} attempted to load {1} from a fleet you don't control. Order has been canceled.",
        "{0} attempted to set it's amount of {1} on board to {2!s}. Unfortunately {3} couldn't provide enough. Fleet will wait until able to fulfill the order.",
        "{0} attempted to set it's number of {1} on board to {2!s}. Unfortunately {3} couldn't provide enough people. Fleet will wait until able to fulfill the order.",
        "{0} attempted to load {1!s} from deep space. The attempt was unsuccessful.",
        "{0} attempted to steal {1!s} colonists from {2}. The attempt was unsuccessful.",
        "{0} attempted to steal {1!s}mg of fuel from {2}. The attempt was unsuccessful.",
        "{0} failed to load fuel from {1}.",
        "{0} is at {1} and has been rerouted to {2}.",
        "{0} is at {1} and has been rerouted to {2}. Unfortunately it does not have enough fuel on board to make the journey so the fleet will wait for further instructions.",
        "{0} has orders to build a mineral packet, but either doesn't have a mass accelerator, or hasn't targeted the accelerator. The order to build has been canceled.",
        "{0} has orders to build planetary installations beyond the maximum allowed. The orders have been reduced to the maximum allowable.",
        "A mysterious trading vessel broadcasting a proposal has been detected entering known space.",
        "{0} has improved {1} from a value of {2!s}% to {3!s}%.",
        "{0} is currently unable to improve the value of {1} beyond {2!s}%.",
        "{0} has retro-bombed {1}, undoing {2!s}% of its terraforming.",
        "{0} has orders to terraform beyond the maximum allowed. The orders have been reduced to the maximum allowable.",
        "The Mystery Trader has inexplicably changed his course and/or speed. Perhaps something startled him?",
        "Your mineral packet has permanently {0} the default {1} on {2} by {3!s}%.",
        "A mineral packet has permanently {0} the default {1} on {2} by {3!s}%.",
        "Your mineral packet has {0} the {1} on {2} to {3!s}.",
        "A mineral packet has {0} the {1} on {2} to {3!s}.",
        "{0} has tried to beam colonists down to {1}, but the planet's starbase would kill them all before they land. The bridge crew rescinds the order.",
        "Your scientists have completed research into Tech Level {0!s} for {1}. Their primary research focus for next year is the {2} field.",
        "{0} has executed orders to follow a fleet and awaits further direction.",
        "{0} had orders to follow a fleet which didn't move. The crew awaits further orders.",
        "Examination of wreckage from the battle at {0} uncovered plans for a new part to place on your ships.",
        "Examination of wreckage from the battle at {0} uncovered plans for a new ship hull.",
        "{0} has been dismantled for {1!s}kT of minerals at the starbase orbiting {2}. In the process you have discovered a new technology.",
        "{0} has been dismantled for {1!s}kT of minerals at the starbase orbiting {2}. In the process you have gained a research level in {3}.",
        "{0} has been dismantled for {1!s}kT of minerals which have deposited on {2}. It has also made {3!s} resources available for immediate use. In the process you have discovered a new technology.",
        "{0} has been dismantled for {1!s}kT of minerals at the starbase orbiting {2}. It has also made {3!s} resources available for immediate use. In the process you have gained a level in {4}.",
        "{0} has been dismantled for {1!s}kT of minerals which have deposited on {2}.",
        "{0} has been dismantled for {1!s}kT of minerals at the starbase orbiting {2}.",
        "{0} has been dismantled for {1!s}kT of minerals which have deposited on {2}. Ultimate recycling has also made {3!s} resources available for immediate use.",
        "{0} has been dismantled for {1!s}kT of minerals at the starbase orbiting {2}. Ultimate recycling has also made {3!s} resources available for immediate use.",
        "A battle took place at {0}. You destroyed {1} killing {2!s} of their colonists in the bargain.",
        "Your recent breakthrough in {0} has also taught you how to build {1} defenses. All existing planetary defenses have been upgraded to the new technology.",
        "{0} was bombarded with a packet containing {1!s}kT of minerals. However, the packet didn't damage any of your installations or kill any colonists.",
        "{0} attempted to reach {1} via stargate, but could not because no stargate could be detected at the destination.",
        "You couldn't give {0} away because that player is dead.",
        "You couldn't give {0} away because there were some of your colonists on board.",
        "You couldn't give {0} away because {1} didn't have the administrative capacity to maintain the fleet's records.",
        "{0} attempted to give you a fleet, but you don't have enough excess design capacity to complete the transaction.",
        "{0} snub your attempted gift and refuse the fleet.",
        "{0} has successfully been given to {1}.",
        "{0} have given you {1}.",
        "{0} has been absorbed by the Mystery Trader. In return, you have been given {1!s} of the Trader's auxiliary ships for your own use.",
        "{0} has been absorbed by the Mystery Trader. In return, the trader tried to give you a ship, but you were unable to store the design records necessary for upkeep.",
        "A mass packet appears to be on a collision course with {0}, which currently is unable to safely catch the packet.",
        "Your starbase at {0} is scheduled to complete all remaining production items this year.",
        "You have received one battle recording this year.",
        "You have received {0!s} battle recordings this year.",
        "{0} is not allowed to transfer colonists to another player.",
        "{0} has been auto terraformed to a value of {1!s}%.",
        "Your recent breakthrough in {0} has also taught you how to build the {1} scanner. All existing planetary scanners have been upgraded to the new technology.",
        "Breeding activities on {0} have overflowed living space.  {1!s} colonists have been beamed down to {2}.",
        "Your intelligence gathering activities combined with synergistic science have aided your research efforts in {0} by {1!s} resources.",
        "{0} has degraded {1} from a value of {2!s}% to {3!s}%.",
        "{0} is currently unable to degrade the value of {1} beyond {2!s}%.",
        "Your engineers on {0} have managed to improve the underlying {1} by 1%.",
        "You have info on a new planet. If you colonize {0}, you can make its value {1!s}%.",
        "{0} was unable to use the stargate at {1} because you had colonists on board and do not control the planet.",
        "{0} has been annihilated in a {1} {2} mine field at {3}.",
        "{0} has been damaged by a detonating {1} {2} mine field at {3}. Your fleet has taken {4!s} damage points but none of your ships were destroyed.",
        "{0} has taken damage from a detonating {1} {2} mine field at {3}. Your fleet has taken {4!s} damage points and {5!s} of your ships were destroyed.",
        "{0} has been annihilated in your {1} mine field at {2}.",
        "{0} has been damaged by your detonating {1} mine field at {2}. Your mines have inflicted {3!s} damage points, but you didn't manage to destroy any ships.",
        "{0} has been damaged by your detonating {1} mine field at {2}. Your mines have inflicted {3!s} damage points and you have destroyed {4!s} of the ships.",
        "{0} has tried to beam colonists to deep space. This order has been canceled.",
        "Your fleets have bombed {0}, killing {1!s} colonists.",
        "Your fleets have bombed {0}, destroying one installation.",
        "Your fleets have bombed {0}, destroying {1!s} defenses, factories and mines.",
        "Your fleets have bombed {0}, killing {1!s} colonists, and destroying one installation.",
        "Your fleets have bombed {0}, killing {1!s} colonists, and destroying {2!s} defenses, factories and mines.",
        "Your fleets have bombed {0}, killing {1!s} colonists. Planetary defenses stopped {2!s} of your bombs.",
        "Your fleets have bombed {0}, destroying one installation. Planetary defenses stopped {1!s} of your bombs.",
        "Your fleets have bombed {0}, destroying {1!s} factories and mines. Planetary defenses stopped {2!s} of your bombs.",
        "Your fleets have bombed {0}, killing {1!s} colonists, and destroying one installation.  Planetary defenses stopped {2!s} of your bombs.",
        "Your fleets have bombed {0}, killing {1!s} colonists, and destroying {2!s} defenses, factories and mines. Planetary defenses stopped {3!s} of your bombs.",
        "{0!s} fleets have bombed {1}, killing {2!s} of your colonists.",
        "{0!s} fleets have bombed {1}, destroying one of your installations.",
        "{0!s} fleets have bombed {1}, destroying {2!s} of your defenses, factories and mines.",
        "{0!s} fleets have bombed {1}, killing {2!s} of your colonists, and destroying one of your installations.",
        "{0!s} fleets have bombed {1}, killing {2!s} of your colonists, and destroying {3!s} of your defenses, factories and mines.",
        "{0!s} fleets have bombed {1}, killing {2!s} of your colonists. Planetary defenses destroyed {3!s} of the incoming bombs.",
        "{0!s} fleets have bombed {1}, destroying one of your installations. Planetary defenses destroyed {2!s} of the incoming bombs.",
        "{0!s} fleets have bombed {1}, destroying {2!s} of your defenses, factories and mines. Planetary defenses destroyed {3!s} of the incoming bombs.",
        "{0!s} fleets have bombed {1}, killing {2!s} of your colonists, and destroying one of your installations. Planetary defenses destroyed {3!s} of the incoming bombs.",
        "{0!s} fleets have bombed {1}, killing {2!s} of your colonists, and destroying {3!s} of your defenses, factories and mines. Planetary defenses destroyed {4!s} of the incoming bombs.",
        "Your fleets have retro-bombed {0}, undoing {1!s}% of its terraforming.",
        "{0!s} fleets have retro-bombed {1}, undoing {2!s}% of its terraforming.",
        "Your fleets have bombed {0}, killing off all the enemy colonists.",
        "{0!s} fleets have bombed {1}, killing all of your colonists.",
        "Due to excessive fleet maneuvering in the battle area, some of your fleets could not participate in the battle at {0} and will be unable to fulfill their assigned tasks this year.",
        "{0} was bombarded with a {1!s}kT mineral packet. Fortunately, no one was home at the time."
    ]
}
